import os
from dotenv import load_dotenv
import telebot
from telebot.types import ReplyKeyboardMarkup, KeyboardButton

# Завантаження змінних з .env файлу
load_dotenv()

bot_token = os.getenv("BOT_TOKEN")
bot = telebot.TeleBot(bot_token)

@bot.message_handler(commands=['start'])
def start(message):
    # Створюємо клавіатуру Reply
    reply_markup = ReplyKeyboardMarkup(resize_keyboard=True)
    btn1 = KeyboardButton("Інформація для покупців")
    btn2 = KeyboardButton("Що є в наявності?")
    btn3 = KeyboardButton("Записатись в шоурм")
    reply_markup.add(btn1, btn2, btn3)

    # Відправляємо повідомлення з Reply клавіатурою
    bot.send_message(message.chat.id, "Ласкаво просимо до нашого магазину м'яких меблів! 🛋️ Ми тут, щоб зробити ваш вибір максимально зручним. Що саме вас цікавить?", reply_markup=reply_markup)

@bot.message_handler(func=lambda message: True)
def handle_message(message):
    if message.text == "Інформація для покупців":
        bot.send_message(message.chat.id,
                         """Я, Андрій, радий вас бачити! Ось важлива інформація, яка допоможе вам зробити замовлення:
🕒 Візити до нашого магазину:
Графік: Пн-Сб (по попередньому запису по телефону або вайбер / телеграм).
Зверніть увагу: Наш простір не є виставковою залою. Ми маємо в наявності лише невелику кількість найпопулярніших моделей, крісел-реклайнерів та оббивок.
Будемо раді допомогти вам знайти ідеальні меблі для вашого дому!

📜 Процедура замовлення:
Договір: Усі замовлення оформлюються на підставі договору.

⏱Терміни виготовлення: 
Виготовлення меблів займає орієнтовно 3-4 тижні, але є варіанти швидкого виконання.

💵Передплата: 
Передплата складає від 50% і може бути здійснена на реквізити ФОП (або готівкою/терміналом у Києві).

💵Доплата: 
Решта суми сплачується по готовності виробу.

🚚 Доставка та вантажники:
Доставка по Києву: 800 грн.
Доставка по Україні: 1500 грн (до вашого дому).
Вантажники: Послуги вантажників оплачуються окремо і доступні лише по Києву.

Якщо у вас є питання або ви хочете записатися на відвідування, зв’яжіться з нами!""")
    elif message.text == "Що є в наявності?":
        bot.send_message(message.chat.id,
                         "✨ **Увага! Обмежений вибір!** ✨\n\n"
                         "Ми працюємо саме для вас, щоб допомогти знайти ідеальний диван, який буде відповідати вашим потребам у розмірі, кольорі, механізмі та оббивці. 💫\n\n"
                         "Оскільки наш асортимент змінюється дуже швидко, ми оновлюємо наявність тільки найпопулярніших моделей, і навіть це не завжди вдається вчасно. 🕒\n\n"
                         "**Але не хвилюйтесь!** Якщо у нас немає потрібної моделі в наявності, ми зможемо виготовити диван саме під ваші вимоги і навіть продемонструвати його зручність на іншій моделі. 👍\n\n"
                         "Щоб дізнатися, які моделі зараз є в наявності, переходьте за посиланням нижче:\n\n"
                         "🔗 [Перевірте наявність моделей тут!](https://drive.google.com/drive/folders/1L-5I6_r5ZnnY8jfpFjHjX_y8ZG1MMzcO?usp=sharing)\n\n"
                         "Не пропустіть можливість знайти свій ідеальний диван!", parse_mode='Markdown')
    elif message.text == "Записатись в шоурм":
        viber_number = "+380633113097"

        telegram_url = "https://t.me/https://t.me/@Eurodivan"

        bot.send_message(
                        message.chat.id,
                   f"✨ **Запрошуємо вас в шоурум!** ✨\n\n"
                        f"Щоб записатися на перегляд або отримати більше інформації, ви можете зв’язатися з нами через Viber або Telegram:\n\n"
                        f"📱 **Viber**: Скопіюйте номер **{viber_number}** і використайте його у Viber.\n\n"
                   
                        f"📱 **Telegram**: [Натисніть тут, щоб відкрити Telegram]({telegram_url})\n\n"
                        f"Ми будемо раді вас бачити і допомогти з вибором меблів для вашого дому!", parse_mode='Markdown')

# Запуск бота
bot.polling()
